[{"comment":"Friendly staff, convenient location near Victoria Uni Footscray campus, bus stop and tram station.","rating":5,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"I stay here for 2 year and it make me feel home. Safe and clean.","rating":5,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"I makes a lot of friend here too and having a lot of happy memories here.","rating":5,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"The staff is very polite and gentle specially Sheetu and Jordan who are always there to help whenever we need  it . The location is ideal close to uni and transport . It’s highly recommended","rating":5,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"5 Star service experience here at UniLodge @ VU. I wouldnt recommend you stay anywhere else. Great staff, great vibe and a really nice Great Greek Manager. Awesome stuff UniLodge.","rating":5,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"The management is really terrible and there is no air conditioner in the summer. It isn’t worth to pay here.","rating":1,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"The management at UniLodge is appalling to say the least! A particular older man, presumably the head manager, went out of his way to be extremely rude and unrealistic in his asking. As I was waiting for a friend to come down from her room, in the lobby while holding my bicycle beside me, this man came out behind the front desk demanding me to either put my bike in my room immediately or wait outside with my bike. He claimed that one is not allowed to have a bike in the lobby at all. I asked what harm myself and my bike were causing to the facility or other people, and he replies extremely rudely with 'your opinion does not matter, those are the rules'. After re-examining the VU Resident Handbook, there is absolutely no evidence that states one can not wait in the lobby with a bicycle. This mans request was completely unrealistic, and his attitude was extremely uncalled for. His lack of professionalism and problem solving skills should be looked into by higher authority. I will most definitely be sharing my story!!!","rating":1,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"The room and the housemates are really terrible. Their management and the way to solve the problem was awful. Their staff and manager can do nothing for you when we need help. It's  not worth to pay the money to live here since they tend to ignore your right.","rating":1,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"Highly recommend this place to anyone. So close to Uni, the train station and the city worth every cent","rating":5,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"The staff are extremely nice and very helpful people. After feeling claustrophobic and disgusting at some left over dirt in the first room they assigned me they took me to three other rooms trying to find a great one. After a traumatic heat-related experience (will explain further below) I wrote an overly harsh review that didn't focus enough on the good points and instead of kicking me out or getting mad they understood I wasn't trying to hurt them, but simply inform people of the problem I faced, and offered to move me to a room that gets less sun in an attempt to help. I am now happily moved into that new room. No matter how much of a nuisance I've been or how many complaints I've brought up in only two weeks of staying here they have always greeted me with a smile and been helpful and understanding. They're extremely attentive and friendly. I've never seen staff that were so great!","rating":5,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"The rooms themselves are good, I have a regular studio on the 3rd floor so the view is fairly close to the ground but it's still a good view. I've never gotten a noise complaint despite watching the TV loudly and clattering a lot while doing the dishes and moving. I also haven't heard a peep from my neighbours. Outside can get a little loud, it's noisier on the cooler side of the building and on the hotter side you get to watch people play basketball (the one thing I really miss from that room). If you're large the bathroom may be a bit of a tight fit, but I'm about 26kg overweight and I'm really comfortable so there's definitely room. The showers don't have removable shower heads, they're fixed, and they don't have doors just curtains. So if you're like me and weren't used to that, just know it's not impossible to adapt haha. The kitchen has plenty of room, it's actually a pretty decent kitchen and the bed is a king single, which is bigger than my old bed so I was pretty happy. The bed jiggles a lot and you may need a mattress topper to be comfortable but test it out first to make sure, it isn't that bad. I got a topper and it's great with that. There's a TV and lots of room, really, for one person. You fill out a condition report when you first come, mention everything, loose handles, dirt, stains on walls, anything even minor with the room that you find is off and they'll come and fix it for you pretty quickly (provided people are available quickly, the maintenance guy was on break when I first arrived so it took a little longer to get stuff fixed, they'll tell you if something like that is going to happen though). The lamps get VERY hot though, so if you're contending with heat, use the overhead lights.","rating":3,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"So far the residents seem nice, I haven't gotten any flaque. The town is scary and new but I haven't encountered any trouble there either so far. Just be cautious at night, like anywhere else. The Unilodge is right next to a bus and tram stop and the train station has bus stops and tram stops right across the road, so if you need to get somewhere and it's too late or hot to walk public transport is right there. Parking is pretty big too, but I dunno how easy it is to get a spot or how much it is because I don't own a car. Sorry.","rating":4,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"Unilodge@VU is by far the best affordable student accommodation near Melbourne, only three stops from Southern Cross Station and apparently close to Highpoint (I've never been but I've heard from others). There's also a HUGE Coles and K-Mart about a 20 minute walk away, at most, and an IGA in the other direction (near a McDonald's, shh).","rating":5,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"Note though, the rooms do not have air conditioning, if you're like me and suffer anxiety and heat stroke you may want to specifically ask for a room that doesn't get much sun. Look online for other heat management stuff too. I bought a cheap portable evaporative cooler, stuck foil to the window to reflect the sun away from the room (shiny side out), got a pedestal fan, a spray bottle of cold water and Kogan cooling mats for my bed. There's other stuff you can do too like clothes that actively cool you off, you can find them online, or you make your own with thick water proof pockets sewn on a shirt with ice packs in the pockets. The heat is the only reason that one star is missing. It's only 25% of the year at most and it's during the time a lot of people go back home for the holidays so you shouldn't have to cope with it for too long, I just don't want you to have any illusions. The past few years this area has experienced heatwaves around the middle of summer, it gets very hot, and if a heat wave hits I want you guys to be ready. If you really love the heat then you're in luck, there's heaters in every room and summer can get hot lol.","rating":3,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"I hope you guys enjoy it here regardless, they have so many events each month to meet new people and get free food and there's a freakin' basketball court! Plus, no bills, the rent covers all your costs, I still don't really know how to pay it because I'm independent for the first time but I only have to worry about one thing instead of fifteen bazillion things. One or two things, I can't remember, at most two. So relax and enjoy it here, and if anything's wrong say so, ask for help. They can't fix a problem they don't know about. If you're in a hot room ask if you can move to a cooler one. If your room is filthy, ask them to clean it. It's ok, they'll do what they can. : )","rating":4,"link":"https:\/\/www.facebook.com\/unilodge.vu\/reviews","category_id":4},{"comment":"lets say any boarding house in victoria… lets say any boarding house in victoria as I know the legislation there and have had a bit too do with the tribunal system there. of course your answer was to divert. making me think I am right. either that your you have found a loop hole to take advantage of the weak poor and disadvantaged. international students will not know about this and most 18 year olds and there parents who either rent there own property or own would not know it. I have acted onbehalf of international students before to stop preditory actions from landlords. I will take my time get advice and we shall see were this goes. too have no compassion dure in covid lock down will make this a true pleasure. there was law passed about lockdown and rental agreements. what makes you think you were above the law ? a peice of paper is only as good as the legislation behind it. so before everyone at your lodges learns about tenancy tribunal answer the question. If I am right and I think I am you will have to pay a lot of money back. I would also think a curent afair would love to hear about your actions dure in covid. truly amazing that you have stated your place online so others can see it including the tribunal and media. did you know the fine for not lodging a bond with the bond authority in victoria is around $16,000 per person? and it states that any money taken that is not rent as a holding fee incase of damages etc is a bond even if the landlord pretends it is not. I wonder what 16 grand multiplied by everyone you have had stay there would be ? do you lodge your bonds with the bond authority ? to all the people reviewing here did you get a recipet from the bond authority ? if not it is illegal too collect a fee for damages or unpaid rent for a room or apartment. I doubt we can classify you as a hotel as you have long term contracts. I have never heard of you being put too the test. it will be interesting to see the outcome.","rating":1,"link":"https:\/\/www.trustpilot.com\/review\/unilodge.com.au","category_id":4},{"comment":"Unilodge on Riversdale Road, Melbourne, Victoria. Unilodge on Riversdale road, Melbourne, VIC 3122 is the horrible place with the worse managment ever. They have students as RA to help out the tenants but they select students as RA that they smoke in their apartments while they have already deactivated fire alarms, and party till morning and make noises and bother neighbours.  If you contact manager, they just ignore.  Just avoid the Unilodge in Melbourne.","rating":1,"link":"https:\/\/www.trustpilot.com\/review\/unilodge.com.au","category_id":4},{"comment":"Unilodge illegal coronavirus Isent my daughter to stay with unilodge during coronavirus and they way they handled it is disgusting. My daughter was not allowed to have any visitor in the building even her parents but there are staff coming in every day bringing the virus into the building and putting everyone in danger!!! My daughter asked one of the staff if she could have a meeting with her (apparently this person in charge of welfare!!!) and she said that they were only doing zoom. Then why are they coming into the building every day and I am not allowed to have dinner with my daughter,?? If only doing zoom meetings then why not work from home?? Unilodge is illegal and dangerous and should be sending staff in VICtoria home like everyone else and letting my daughter have the welfare she needs by seeing me","rating":1,"link":"https:\/\/www.trustpilot.com\/review\/unilodge.com.au","category_id":4},{"comment":"BEWARE FAKE REVIEWS\/ REVIEWS BY NAIVE INTERNATIONAL STUDENTS \/ UNILODGE STAFF I wish could say my experience at unilodge was positive, I really do. The first few weeks started off well, but from the get go of meeting the people running the place it was clear that they had overarching power and were willing to abuse. Although no utility bills are paid here, this student accomodation is not coveted under housing victoria\/RTA which allows management to get away with alot EG: giving breaches out for silly reasons like attending parties. I stayed at unilodge vu for over a year. The main reason people like this venue is because of its safety, yet after I had stayed at the place for a year and was assaulted by a roommate I was told to leave as they had found a novelty ‘bong’ in my room, smoke detector covered up (I was painting in my room), and had a friend staying over a few nights without permission from the unilodge overlords. The unnamed person who assaulted me and bullied me for several months remains staying at unilodge (unilodge don’t do background checks before allowing residents to move in). With that said, I can now happily say I am now renting in a share-house and while I have to pay utilities the rent is much cheaper and I can wash my clothes for free. Unilodge claim they provide support but for the 3 months of lockdown the only ‘support’ i was given living on my own was a phone call once every couple of weeks to make sure I hadn’t shot myself yet. It’s clear that Unilodge bottom line is more important than providing a safe, nurturing accommodation for young adults moving out of home as the violent person remains at unilodge as he agreed to move to a more expensive room. I will also be submitting this review to Consumer Affairs.","rating":2,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"The coffee at Tiernan Cafe was amazing! You can tell the barista takes great care when making your coffee.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"My experience living here started out well but after time it was less enjoyable. Not cheap.","rating":3,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"Have been a UnilodgeVU Resident since a long time now and can say it is the best place for a student to reside, not only because they provide you with an excellent service and place to stay but also they support and take care of you like a family. I highly recommend staying at UnilodgeVU!","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"The management at Unilodge VU show a lack of empathy and understanding for students, especially as we go through these extremely stressful times during exams and the fact that we are currently in a global pandemic.there have been unannounced visits from staff into rooms which breaches their own contract and shows the lack of professionality that the management provides.living at this accommodation feels more like a prison cell rather than the enjoyable uni lifestyle it should be.","rating":1,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"Reception always call me all the time, call me when I'm in class, call me when I'm at work, call me when I'm sleeping, I'm sick and tired of it","rating":1,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"I've been living here for a year and a half now. The thing I like the most about this place is that they take mental health very seriously and regularly check with their residents. The staff were very supportive and helpful during the pandemic. Amazing place to live!","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"Its been more than a Year in Melbourne as well as in Unilodge @ VU and I have never shifted to other places. Reason being the facilities provided on cheaper rates. For international students, bearing expenses of rent is really tough. I am paying the same amount what my other friends are paying and the best part is the events which occurs every week, you will get lots of friends to interact and network with.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"Been here for almost 2 years now and I just love everything about the place. The half basketball court, common area with the pool table, cinema room, study rooms, outdoor spaces and the furnished apartment are just amazing. Furthermore, the staff here at Unilodge are so friendly, kind and always make sure that everyone is safe and enjoy their stay here. I came here as an international student in 2019 and apart from missing home, I have met friends from all over the world and had the best experience in my life here at Unilodge. So proud to call this place home away from home.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"A place with very friendly atmosphere and convenience. Made life so much easier during the pandemic. Love the latest green initiatives and the variety of community spirit programs that cater to the taste of everyone.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"Overall the experience was great. I would strongly recommend VU Unilodge to those international students who are newly finding accomodations in footscray. It is safer and you will be taken care of.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"Friendly staffs. Always ready to find new ways to help us, specially during the lockdown, they kept us entertained with their events.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"The accommodation itself is a good place to live in, with easy access to Victoria University. The problems in the place mainly comes from having a noisy roommate, the laundry fee for the machine only accepts 1 or 2 dollar coins, and the random interval fire drills that sometimes happens during the most inconvenient of times. But other than that, the staff are usually quite helpful and amicable.","rating":3,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"Very friendly atmosphere for students with great support from the staff! Makes sure that the stay here is comfortable with good attention given to cleanliness. Would definitely recommend:)","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"As an international student, I really appreciate and recommend unilodge Footscray, hospitality and staff services. It's very professional and supportive.cheers.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"A very nice welcoming accomodation facility for students, amazing staff members, very supportive and just amazing.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/unilodge-victoria-university-697074","category_id":4},{"comment":"Average good accommodation for budget seekers very close to university of Melbourne and RMIT and CBD","rating":4,"link":"https:\/\/au.oceaniabiz.com\/victoria\/570-swanston-st-73378","category_id":3},{"comment":"A rather old apartment building in a convenient location. The rents here are usually below average. Great place to stay for college students.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/570-swanston-st-73378","category_id":3},{"comment":"Excellent apartments with well placed balconies on the north side. A lot of sun in the afternoon.","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/570-swanston-st-73378","category_id":3},{"comment":"Great student accommodation, close to the University of Melbourne","rating":5,"link":"https:\/\/au.oceaniabiz.com\/victoria\/570-swanston-st-73378","category_id":3},{"comment":"This student accommodation is just walking distance from RMIT University and The University of Melbourne. Which is really great especially for the convenience of the students who have to juggle a lot of different things during their Uni time.","rating":5,"link":"https:\/\/amberstudent.com\/places\/unilodge-570-swanston-melbourne-1810136999800","category_id":3},{"comment":"The city centre is only close to 10 minutes away from this student housing option so you can easily grab a quick bite or shop around and maybe even see some of the local attractions that this place has to offer.","rating":5,"link":"https:\/\/amberstudent.com\/places\/unilodge-570-swanston-melbourne-1810136999800","category_id":3},{"comment":"This student accommodation gives you the option to select from a wide range of well-furnished apartments so that you can make a better choice depending on several factors such as finance and individual preferences.","rating":5,"link":"https:\/\/amberstudent.com\/places\/unilodge-570-swanston-melbourne-1810136999800","category_id":3},{"comment":"HORRIBLE...I've been living with cockroaches for months (actually I saw one at night of the first day I moved in after I've signed the contract)... I talked to the management while they heartlessly asked me to buy pest control myself with a smiling face. And today I saw mice...Also, the bathroom is shared. Not only with other residents, but also with moths and all kinds of wired creatures. You will also share the kitchen with the sparrows. Besides, the heater is time limited, you have to remember to press the button every several hour to keep your room warm in winter. Plus, I don't know what's wrong with their fire alarm. It has rang about 10 times (3 time at midnight) since I moved here with no actual danger. The loud noise of the alarm seems more harmful then the fire threat, it mights hurts hearing. Moreover, the internet is not only expensive ($39.95 for 30000 MB) but also INCONTINENCE . It allow you to connect ONLY ONE device at a time. So if you want to use internet on tablet while your laptop is connected to the line, you have to: first, login to the portal on your tablet; second, select the disconnect button in the portal for your laptop; third, re-login to the portal; forth, select connect button in the portal for your tablet.I can write even more complaints for this horrible accommodation....The rent is $1083 per month for a single room.","rating":1,"link":"https:\/\/www.yelp.com\/biz\/unilodge-740-carlton-3","category_id":2},{"comment":"My partner lives in this building so I'm constantly in and out of the place. Although his apartment is in a relatively well-maintained condition, I wouldn't be surprised if many of the other rooms available weren't. The building itself is not bad, but it's some of the people living inside this student accommodation where the problem lies. It seems as though they have no respect for the place or the other people living in it. Cleaners only come once a week, which wouldn't be all that bad if it weren't for the idiot\/inconsiderate tenants that decide it's okay to leave rubbish in the middle of the hallway (such as empty bottles and wrappers). It stays there for the entire week, and the owners of the rubbish happily walk past it day in and day out without a care. Even the lift has scrunched up papers and wrappers in it, I mean...seriously? The type of people that live here must be idiots. Last week the fire alarm went off and we were required to exit via the stairwell, we discovered to our horror that on one of the floors someone had continuously left their rubbish! Yes, bags upon piles of bags of rotting stinky rubbish! And no, it wasn't like papers and recycling items, it was real rubbish with rotting food etc. I have no idea who thinks it would be okay to leave rubbish in a stairwell, not only is it a fire hazard (because it was blocking half the platform), but it's plain stupid and shows the lack of care some of these tenants have for the place.If this place managed to get rid of the retards, it would be very livable. For now, we just put up with the sights and smells and pray whoever doing it gets struck by lighting.","rating":2,"link":"https:\/\/www.yelp.com\/biz\/unilodge-740-carlton-3","category_id":2},{"comment":"If only they were as diligent with settling urgent repairs as they are when bombarding you with multiple reminders for rental payment on a different platform. overall the place is still liveable and the location is good. But don't ever count on the management here.","rating":4,"link":"https:\/\/www.yelp.com\/biz\/unilodge-740-carlton-3","category_id":2},{"comment":"In 2013 I took a 12 month lease with UniLodge, at the building on Raleigh Street. I will start with the positives of my time here, for one thing, the social atmosphere was fun and friendly, and sometimes quite rowdy and loud, which may be a deal breaker or a deal maker depending on who you are. One thing that was quite strange was that many of the residents were a lot older and were not students, despite Unilodge being 'exclusive' to university students. This was no bother to anyone, I would say it was more their loss, having to put up with all the young 18- 20 somethings running around.Back to the positives, it's a lovely building, it has a lovely view of chapel street and it is cleaned regularly. However, that being said be prepared to be woken up at 8 or 9 in the morning once a week by the cleaning lady banging her vacuum against your door as she cleans the halls.My room was a 'large' studio with balcony, and as I will admit it was a little bigger than the smaller ones, it was still very, very small. For the price of $1,063 dollars a month, they are really taking advantage of people who need to live there but can hardly afford it. However, all student accommodation is a rip off, so I wont hold that against them. I do not recommend getting a balcony, for the added price it was relatively useless, too small to even sit outside. I only ever used it for temporarily storing full rubbish bags until I went downstairs to the bins.Another thing that is a complete rip off is the lock out fee, I believe it was around $40 during the day time to get back in the room and $80 at night. And by night I mean later than 5PM. Over the corse of the year I ended up paying around $200 in lockout fees, when only getting locked out three times. Its not like its a terrible burden on any of the staff to unlock our door, literally all they would do is come out of their room, a floor down go up the elevator and unlock my door with their master key. AFTER of course, I signed a contract saying I will pay them $80. If the RA happens to be out at work or Uni when you are locked out your only option is to go to the Carlton office and pick up a spare key, which is around 30 minutes each way on a tram.From the very beginning, I had problems with the staff at Unilodge. They did not bother to make sure all my furniture was there when I moved in, I was missing a desk chair and a lounge chair. So essentially, I had no chairs in my 'fully furnished apartment'. I didn't mind at the time, I put it in a report and called them about it too. They promised to send it in the next week, but they did not. I called them 2 more times after, and never did I get the furniture I was meant to get.Another thing all students got was a swipe key to get in the building and into the bin area, they didn't give me one with my other keys, saying they had to order more and I would get mine shortly. I didn't. Not that it was an issue getting in, I could use my master key, but when going to the bins I couldn't get back into the building. Each and every time, I would have to go back out onto the street and back in through the front door again, and it got very infuriating. I asked countless times for a swipe key, they said they would send me one, they are ordering more in etc ect. In fact when I resigned my lease, the office lady told me \\We should have some in soon","rating":2,"link":"https:\/\/www.yelp.com\/biz\/unilodge-740-carlton-3","category_id":2},{"comment":"Unilodge has charged me the wrong monthly rent since the day I moved. Every time I paid the figure i was told for the month, (monthly rent changes according to number of days in a month). However when i ask about how much i have to pay the following month. They tell me I still have rent owning for the previous month. How is that possible when i paid the exact figure they asked me to.Every time i went to confront management about g this issue, just so they would get the amount right each time they would say they are currently looking into it as a way of stalling the settlement of the issue.All in all, they are never accountable with your money, charge you for everything possible, and would put all blame on you just so they do not have to bear any responsibility or incur any charges.","rating":2,"link":"https:\/\/www.yelp.com\/biz\/unilodge-740-carlton-3","category_id":2},{"comment":"Pros: Very good location, close proximity to public transport, groceries, restaurants, and university. The receptionist and residential advisors are very kind and helpful. There are cleaners cleaning the common area every day. \nCons: Most of the facilities are rather old and constantly require maintenance. The rooms were quite spacious but have very thin walls and very bad soundproofing. Good luck trying to get a good sleep if you have an inconsiderate neighbor. Conclusion: For the cheap price I was paying, ","rating":3,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Honest review only. Based on my own experience. I hope this review can help you decide on your future stay. Aug 2019: I've been enjoying this place and the people here are nice and friendly. Tram service just outside the un lodge and 15min walk to Melbourne Central. Student facilities such as table tennis, billiard, table football, ps4, TV in the living room, and more. Clean and comfortable place to live","rating":5,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Only rats with proof","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Super friendly reception that cares about residents. For the price, it's a great location. Rooms are great with a massive deck perfect for university and the added basin is a nice touch just keep in mind there is no aircon in the room. Kitchens are kept pretty clean by the cleaners, sometimes left a bit dirty and some areas are a bit dusty but nothing major. The elevators are a bit loud and one has been out of order for a while (but should hopefully get fixed sometime soon).","rating":3,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"The building has banned visitors to enter this building. However, yesterday I saw a guy with a girl from outside (she did not look familiar to me so I asked where she lived when we encountered in the corridor, she said she was not the resident here). UniLodge does not have a concrete policy to completely stop visitors to come in. How dangerous it is.","rating":2,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"I would give them 2—3 stars. Given the pest problem, the constant state of uncleanliness, the lifts constantly being broken and the management not dealing with these issues in a way that resolved them permanently. However, there was a real sense of community there — so I would still recommend it if you can deal with those things. But given I saw 4 reviews from RAs that were working there at the time that they reviewed it — for 4 stars and for 5 stars, I’m giving them one star to balance it ou","rating":3,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Very convenient place","rating":5,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Friendly and helpful receptionist, staff and residents. Location just across the University Melbourne, short walk to popular Lygon st and Woolworths, and only a few tram stops away from Melbourne CBD. Clean and comfortable place to live. Worth the money!","rating":5,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Nice place for students accommodation near major universities","rating":5,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"You can meet a lot of friendly people with the way the building is set up with a shared kitchen. The fortnightly barbeques and events are both really fun and well priced. The location is great and it's a great price for the proximity to university.","rating":5,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"If you are looking for rude customer services, dirty living environment, and expensive living fees, come and move in.","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"I've spent my previous semester at UniLodge@Melbourne and I genuinely like the place. I've read all the other reviews and I guess I understand why people feel the way they do. Firstly, this is my own personal experience. I live on the 10th floor and I have an amazing view from my room. The room is great and I have no complaints. The bathroom is and has always been clean during my time here. The kitchens are brilliant. That being said, the cleanliness directly depends on how other floormates use","rating":5,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Stay here if u like automatic closing doors that slam shut 24\/7, mice, cockroaches, no AC except hearing the neighboring buildings' AC all day and night, filthy kitchens, rude reception staff and cleaners, windows in the hallways being left open that make that cause sub artic temperatures, heaters that are on power timers and dont stay on through the night, one of the lifts has been out of service for 3 months, showers with really rough pebbled flooring and hair. If still want to live here enjoy","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"UniLodge has had pest problems (RATS, COCKROACHES AND BED BUGS) for YEARS. Their solution seems to be to ask employees to post fake reviews.Darisen Mootoosamy (Jason) and Viktor Chao who have posted are employees (RAs) at UniLodge.See how dodgy this place is? They will even try to cheat you out of your bond by claiming non-existent damage to the sink.UniLodge is the Kingdom of the Rats. Bullying international students is what they do. Stay away.(If you still sign a contract after all the","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"It is so close to UniMelb and with a fair price. I love the weekly community events that push me out-door to explore the city with only $5.Some people do complain about the mice issue but it never occurred to me even living here for 2 years now. I guess I am lucky and I am happy staying here.","rating":5,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"The environment is clean but there are mouses appear in the room sometimes","rating":3,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"The activities organised by Unilodge are fun.","rating":5,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Just saw a mice in my room. Disgusted, scared and helpless. I don't know where it went or how did it come inside. I'm new here and i already hate it","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"The staff is nice and the location is convenient, but there are mice everywhere (kitchen, rooms, hallways) and you see them again and again… the bathrooms and kitchen get too dirty often.","rating":2,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Mice and cockroaches. In the kitchens. In your room. Mice and cockroaches. This has been a problem for years and years and they lie here saying that it is because of recent building works. Mice and cockroaches and lies. Mice and cockroaches and lies and filthy bathrooms and rude staff. Good lord, I am glad my contract is ending this month.","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Mice everywhere. Overpriced accommodation, do yourself a favour and go elsewhere. Generally nice and friendly community of residents though.","rating":3,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Been staying there for 6 months and can't wait to geto out. Money-wise, u can get a better place with the same money. Service bad.","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"filthy place — mice in the kitchen","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Low price always means the worst service. So I decided to leave, however, even my checking out was a terrible experience! They said the 1252$'s refund would be returned in at most two weeks. Then after two weeks, they sent me a email to ask me if I agree to pay 120$'s cleaning fee, I was angry, why don't just claim that at the beginning? But I still replied that I agree. Another week later, they STILL didn't return back my money, I have to go back to union lodge and speak to them, now I have to w","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"staff is friendly but the place is filthy. not worth the rent","rating":2,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Dirty and dreadful","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"The only good part about this place is the proximity to The University of Melbourne. The staff at the reception are sometimes rude and the place is filled with rats and rodents.","rating":2,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Worst place ever. Dirty and with rats and cockroaches. Dont waste your money here. You can get a better place with this rental rate.","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"this place is the worst: they treat students very badly, toilets are always a mess, fire alarms are triggered on average once a month, vermin on all floors, regardless of season, yet they have the face to overcharge students, just because it is across Uni- not worth it.","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"Before I moved to my unit, there was already a big hole in the ceiling of the bathroom. I had to go to tenan's union to get a letter to ask this lame company to fix the problem. It took over a month to get the job done. Even the worker was suprised about how serious the problem was and called this a bad workmenship. The other major problem was that the hot plate caused short circuit of the whole unit every time turned it on. It also took more than 1 month to be replaced with a new one. The whole","rating":1,"link":"https:\/\/nicelocal.com.au\/melbourne\/realty\/unilodge_melbourne_-_university_accommodation\/","category_id":2},{"comment":"No major problem. Had a nice stay","rating":5,"link":"https:\/\/amberstudent.com\/places\/dwell-village-melbourne-city-1805244273987","category_id":1},{"comment":"The refurbished flats are just amazing. The living and the kitchen space is decent and the room size is great too. Its very well located, very close to the university and the town.","rating":5,"link":"https:\/\/amberstudent.com\/places\/dwell-village-melbourne-city-1805244273987","category_id":1},{"comment":"one of the best student accommodations I have stayed in. It's a contemporary accommodation with all the facilities available a student might need. The staff is excellent, they take care of your smallest needs. I enjoyed my time here and made some great friends.","rating":5,"link":"https:\/\/amberstudent.com\/places\/dwell-village-melbourne-city-1805244273987","category_id":1},{"comment":"Its a very cool place to stay. The rooms are spacious enough, the staff is great. They are always willing to help. The commute to the university is easy, overall I really love this place","rating":5,"link":"https:\/\/amberstudent.com\/places\/dwell-village-melbourne-city-1805244273987","category_id":1},{"comment":"The access to the wifi service was not easy to use. Apparently, it was prepared to be used through a computer more than from the phone or on the TV. The apartment was very nice and comfortable. The heated swimming pool was fantastic!!! The staff was very friendly and always willing to solve any problem that we had. Stayed in January 2022","rating":4,"link":"https:\/\/www.booking.com\/reviews\/au\/hotel\/dwell-village-melbourne-city.html","category_id":1},{"comment":"There was a bit of confusion when we were about to check in. The staff told us that they're only giving us 1 room and if we want another one, we need to pay for it. I showed her the booking details and confirmation however, she was not convinced until I spoke with another staff and explained that I had booked 2 rooms. Also, I forgot to check that there were no A\/C in the room so we had to suffer in a 30+ degree in summer. Lol Movie room and pool. The room in the new building is clean.  Stayed in January 2022","rating":4,"link":"https:\/\/www.booking.com\/reviews\/au\/hotel\/dwell-village-melbourne-city.html","category_id":1},{"comment":"The reception was a bit confusing. We arrived for check-in around 8 pm and had to call after hours to have someone come out to meet us, and when we left, there was no one in reception yet and no one answered the after-hours call so check out was a bit confusing.The pool and the gym were fantastic. The location was so convenient and close to the city. The little village was just so cute and clean as well, especially for affordable accommodation! Stayed in January 2022","rating":4,"link":"https:\/\/www.booking.com\/reviews\/au\/hotel\/dwell-village-melbourne-city.html","category_id":1},{"comment":"There was no dish washing liquid or cloths to clean dishes. Great location. Ease of checking in and out. Good value. Stayed in December 2021","rating":4,"link":"https:\/\/www.booking.com\/reviews\/au\/hotel\/dwell-village-melbourne-city.html","category_id":1},{"comment":"Booking was made online but rang and spoke with managers twice about the girls being 17 with no one over 18 staying with them. A couple of days before they were due to arrive an email was received to say they were cancelling the booking. After a phone discussion with the manager, he reluctantly agreed to honour the booking. On arriving the girls were charged $11+ to use the Eftpos machine to pay for their stay and the bond. The room they were given was filthy and had no utensils, one pillow and the fridge didn't work. The key didn't work. After the first night, they spoke with a reception and she found them another room which was cleaner, had utensils, a toaster and a working fridge. Bond was received back after follow-up emails.The location was good.Stayed in January 2022","rating":3,"link":"https:\/\/www.booking.com\/reviews\/au\/hotel\/dwell-village-melbourne-city.html","category_id":1},{"comment":"The property has no aircon but the fan was ok","rating":3,"link":"https:\/\/www.expedia.com\/Melbourne-And-Vicinity-Hotels-Dwell-Village-Melbourne-City.h16242558.Hotel-Reviews","category_id":1},{"comment":"We stayed at the Village during the Australian Open. The staff was very pleasant and keen to show us the facilities. Great location within walking distance to Lygon Street, University of Melbourne, Women.s Hospital. Tram stop almost at the door which made getting around extremely easy. Handy having cooking facilities including microwave and full-sized fridge.","rating":5,"link":"https:\/\/www.expedia.com\/Melbourne-And-Vicinity-Hotels-Dwell-Village-Melbourne-City.h16242558.Hotel-Reviews","category_id":1},{"comment":"Free Wifi would of been nice","rating":4,"link":"https:\/\/www.expedia.com\/Melbourne-And-Vicinity-Hotels-Dwell-Village-Melbourne-City.h16242558.Hotel-Reviews","category_id":1},{"comment":"10min walk to the free tram. No housekeeping. not really worth the money.","rating":2,"link":"https:\/\/www.expedia.com\/Melbourne-And-Vicinity-Hotels-Dwell-Village-Melbourne-City.h16242558.Hotel-Reviews","category_id":1},{"comment":"Went to Melbourne for 4 days and wanted to find a budget hotel near the CBD Found the RMIT village, wasn't sure about checking in to a place that provides both hotel\/student accommodation services. Nevertheless, I took a chance and was pleasantly surprised. The location is absolutely fantastic, just 5mins on the tram to Burke St (probably 15mins walking). The staff is all very helpful and friendly as were the students who live onsite.","rating":5,"link":"https:\/\/www.expedia.com\/Melbourne-And-Vicinity-Hotels-Dwell-Village-Melbourne-City.h16242558.Hotel-Reviews","category_id":1},{"comment":"Superb","rating":5,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1},{"comment":"Could have been better. The location was good. Booking was made online but rang and spoke with managers twice about the girls being 17 with no one over 18 staying with them. A couple of days before they were due to arrive an email was received to ...","rating":4,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1},{"comment":"An amazing place at center...","rating":5,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1},{"comment":"Beautiful place to stay in...The apartment was very nice and comfortable. The heated swimming pool was fantastic!!! The staff was very friendly and always willing to solve any problem that we had. The access to the wifi service was not easy to use. Apparently, it was prepared to be used through a computer more than from the phone or on the TV.","rating":4,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1},{"comment":"Overall good. I will defo come...Movie room and pool. The room in the new building is clean. There was a bit of confusion when we were about to check in. The staff told us that they're only giving us 1 room and if we want another one, we need to pay for it. I showed her the booking ...","rating":4,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1},{"comment":"It was excellent overall and...The pool and the gym were fantastic. The location was so convenient and close to the city. The little village was just so cute and clean aswell, especially for affordable accommodation! The reception was a bit confusing. We arrived for check in around 8pm and had to call after hours to have someone come out to meet us, and when we left, there was no one in reception yet and no one ...","rating":5,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1},{"comment":"Good","rating":5,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1},{"comment":"Very convenient. Great location. Ease of checking in and out. Good value here was no dishwashing liquid or cloths to clean dishes","rating":5,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1},{"comment":"Superb","rating":5,"link":"https:\/\/planetofhotels.com\/en\/australia\/melbourne\/dwell-village-melbourne-city","category_id":1}]